// сгенерировать двумерный массив случайными целыми числами (ввести два числа и диапазон)

/*
int [,] CreateRandomarray(int x, int y, int min, int max)
{
    int[,] newMatrix = new int[x,y];

    for (int i = 0; i < x; i++)
    {
        for (int j = 0; j < y; j++)
        {
            newMatrix[i,j] = new Random().Next(min,max + 1);
            Console.Write(newMatrix[i,j]+ " ");
        }
        Console.WriteLine();
    }

    return newMatrix;
}

int[,] array = CreateRandomarray(4,5,1,9);
*/

//Задайте двумерный массив размера m на n, 
//каждый элемент в массиве находится по формуле: 
//Aij = i+j. Выведите полученный массив на экран.





//Задайте двумерный массив. Найдите элементы, у которых оба индекса чётные, 
// и замените эти элементы на их квадраты.



//Задайте двумерный массив. 
//Найдите сумму элементов, находящихся на главной диагонали 
//(с индексами (0,0); (1;1) и т.д.